In [107]:
# ###########################################################################################################################
# This project is part of Springboard Data Science Track Career Track for data visualization and exploratory data Analysis  #
# in python.  
#
# This projects uses the data downloaded from 'https://www.divvybikes.com/' in the form of .csv files. for the years        #
# 2014 to 2017. 
#
# The csv files are seperated based on quarters.Here combined quartely data to form seperate dataframe yearwise to          #
# analyse yearwise data.
#                                                                                                                           #
#                                                                                                                           #
#                                                                                                                           #
# # ########################################################################################################################

### Combining csv files for 2014 and create new dataframe trips_2014

In [132]:
import pandas as pd

# data for 2014

In [133]:
filepaths = ['Divvy_Trips_2014_Q1Q2.csv','Divvy_Trips_2014-Q3-07.csv','Divvy_Trips_2014-Q3-0809.csv','Divvy_Trips_2014-Q4.csv']
trips_2014 = pd.concat(map(pd.read_csv, filepaths))
trips_2014.shape

(2454634, 12)

In [134]:
trips_2014.head()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
0,2355134,6/30/2014 23:57,7/1/2014 0:07,2006,604,131,Lincoln Ave & Belmont Ave,303,Broadway & Cornelia Ave,Subscriber,Male,1988.0
1,2355133,6/30/2014 23:56,7/1/2014 0:00,2217,263,282,Halsted St & Maxwell St,22,May St & Taylor St,Subscriber,Male,1992.0
2,2355130,6/30/2014 23:33,6/30/2014 23:35,2798,126,327,Sheffield Ave & Webster Ave,225,Halsted St & Dickens Ave,Subscriber,Male,1993.0
3,2355129,6/30/2014 23:26,7/1/2014 0:24,173,3481,134,Peoria St & Jackson Blvd,194,State St & Wacker Dr,Subscriber,Female,1988.0
4,2355128,6/30/2014 23:16,6/30/2014 23:26,173,638,320,Loomis St & Lexington St,134,Peoria St & Jackson Blvd,Subscriber,Female,1988.0

In [135]:
nans = lambda df: df[df.isnull().any(axis=1)]
nans(trips_2014)[1:5]

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
10,2355119,6/30/2014 23:01,6/30/2014 23:15,1512,844,178,State St & 19th St,55,Halsted St & James M Rochford St,Customer,NaN,NaN
14,2355108,6/30/2014 22:15,6/30/2014 22:35,2070,1198,97,Museum Campus,43,Michigan Ave & Washington St,Customer,NaN,NaN
15,2355107,6/30/2014 22:15,6/30/2014 22:35,546,1217,97,Museum Campus,43,Michigan Ave & Washington St,Customer,NaN,NaN
22,2355093,6/30/2014 21:57,6/30/2014 22:30,989,1964,226,Racine Ave & Belmont Ave,162,Damen Ave & Wellington Ave,Customer,NaN,NaN

In [136]:
null_columns=trips_2014.columns[trips_2014.isnull().any()]
trips_2014[null_columns].isnull().sum()

gender       791280
birthyear    791216
dtype: int64

In [137]:
#delete the rows with NaN VALUES

new_Df_2014=trips_2014.dropna()

# data for 2015

In [138]:
filepaths_1 = ['Divvy_Trips_2015-Q1.csv','Divvy_Trips_2015-Q2.csv','Divvy_Trips_2015_07.csv','Divvy_Trips_2015_08.csv','Divvy_Trips_2015_09.csv','Divvy_Trips_2015_Q4.csv']

In [139]:
trips_2015 = pd.concat(map(pd.read_csv, filepaths_1))
trips_2015.shape

(3183439, 12)

In [140]:
null_columns=trips_2015.columns[trips_2015.isnull().any()]
trips_2015[null_columns].isnull().sum()

gender       929971
birthyear    929855
dtype: int64

In [141]:
#delete the rows with NaN values

new_Df_2015=trips_2015.dropna()

# data for 2016

In [142]:
# it apperas that when the usertype == 'Customer' the data for gender and birthyear is not available.Lets seperate this 
#data from original dataframe so that we can use this for seperate analysis for customers if needed

In [143]:
filepath_2=['Divvy_Trips_2016_Q1.csv','Divvy_Trips_2016_04.csv','Divvy_Trips_2016_05.csv','Divvy_Trips_2016_06.csv','Divvy_Trips_2016_Q3.csv','Divvy_Trips_2016_Q4.csv']
trips_2016 = pd.concat(map(pd.read_csv, filepath_2))

In [144]:
null_columns=trips_2016.columns[trips_2016.isnull().any()]
trips_2016[null_columns].isnull().sum()

gender       858429
birthyear    858125
dtype: int64

In [145]:
new_Df_2016=trips_2016.dropna()

# data for 2017

In [146]:
filepath_3 = ['Divvy_Trips_2017_Q1.csv','Divvy_Trips_2017_Q2.csv','Divvy_Trips_2017_Q3.csv','Divvy_Trips_2017_Q4.csv']
trips_2017 = pd.concat(map(pd.read_csv, filepath_3))

#changing the names of the columns to match with 2015,2016,2014
trips_2017.rename(columns={'start_time': 'starttime','end_time':"stoptime"}, inplace=True)

In [147]:

null_columns=trips_2017.columns[trips_2017.isnull().any()]
trips_2017[null_columns].isnull().sum()

gender       836827
birthyear    836758
dtype: int64

In [148]:
new_Df_2017=trips_2017.dropna()
new_Df_2017.columns

Index(['trip_id', 'starttime', 'stoptime', 'bikeid', 'tripduration',
       'from_station_id', 'from_station_name', 'to_station_id',
       'to_station_name', 'usertype', 'gender', 'birthyear'],
      dtype='object')

# Appending 2014,2015,2016,2017 dataframes together

In [149]:
#appending the 2014,2015,2016 and 2017 data together

total_trips = new_Df_2014.append([new_Df_2015,new_Df_2016,new_Df_2017],ignore_index=True,sort=False)

In [150]:
null_columns=total_trips.columns[total_trips.isnull().any()]
total_trips[null_columns].isnull().sum()

Series([], dtype: float64)

In [151]:
total_trips.head()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
0,2355134,6/30/2014 23:57,7/1/2014 0:07,2006,604,131,Lincoln Ave & Belmont Ave,303,Broadway & Cornelia Ave,Subscriber,Male,1988.0
1,2355133,6/30/2014 23:56,7/1/2014 0:00,2217,263,282,Halsted St & Maxwell St,22,May St & Taylor St,Subscriber,Male,1992.0
2,2355130,6/30/2014 23:33,6/30/2014 23:35,2798,126,327,Sheffield Ave & Webster Ave,225,Halsted St & Dickens Ave,Subscriber,Male,1993.0
3,2355129,6/30/2014 23:26,7/1/2014 0:24,173,3481,134,Peoria St & Jackson Blvd,194,State St & Wacker Dr,Subscriber,Female,1988.0
4,2355128,6/30/2014 23:16,6/30/2014 23:26,173,638,320,Loomis St & Lexington St,134,Peoria St & Jackson Blvd,Subscriber,Female,1988.0

In [152]:
total_trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9645634 entries, 0 to 9645633
Data columns (total 12 columns):
trip_id              int64
starttime            object
stoptime             object
bikeid               int64
tripduration         int64
from_station_id      int64
from_station_name    object
to_station_id        int64
to_station_name      object
usertype             object
gender               object
birthyear            float64
dtypes: float64(1), int64(5), object(6)
memory usage: 883.1+ MB

In [153]:
total_trips.shape

(9645634, 12)

## Final Dataframe for all Years without NaN values

In [154]:
total_trips.head()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
0,2355134,6/30/2014 23:57,7/1/2014 0:07,2006,604,131,Lincoln Ave & Belmont Ave,303,Broadway & Cornelia Ave,Subscriber,Male,1988.0
1,2355133,6/30/2014 23:56,7/1/2014 0:00,2217,263,282,Halsted St & Maxwell St,22,May St & Taylor St,Subscriber,Male,1992.0
2,2355130,6/30/2014 23:33,6/30/2014 23:35,2798,126,327,Sheffield Ave & Webster Ave,225,Halsted St & Dickens Ave,Subscriber,Male,1993.0
3,2355129,6/30/2014 23:26,7/1/2014 0:24,173,3481,134,Peoria St & Jackson Blvd,194,State St & Wacker Dr,Subscriber,Female,1988.0
4,2355128,6/30/2014 23:16,6/30/2014 23:26,173,638,320,Loomis St & Lexington St,134,Peoria St & Jackson Blvd,Subscriber,Female,1988.0

# Converting starttime and stoptime column types to datetime

In [155]:
%%time


total_trips['stoptime'] = pd.to_datetime(total_trips['stoptime'])

Wall time: 17min 18s

In [156]:
total_trips['starttime'] = pd.to_datetime(total_trips['starttime'])

In [157]:
total_trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9645634 entries, 0 to 9645633
Data columns (total 12 columns):
trip_id              int64
starttime            datetime64[ns]
stoptime             datetime64[ns]
bikeid               int64
tripduration         int64
from_station_id      int64
from_station_name    object
to_station_id        int64
to_station_name      object
usertype             object
gender               object
birthyear            float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(4)
memory usage: 883.1+ MB

# Reading Json file to map latitude and longitude of stations

### Stations.json file contains the geographical data about each station location and number of docking points at each station as of 2018
.
### Here the latitude longitude data for start and end stations is appended along with number of docking ports at each station.

In [ ]:
import json
from pandas.io.json import json_normalize

In [ ]:
json_df = pd.read_json('stations.json')
json_df.head()

In [ ]:
loc=[]
for index,row in json_df.iterrows():
    t1=json_normalize(row['stationBeanList'])
    loc.append(t1)
loc_df = pd.concat(loc)
   
loc_df.head()

In [ ]:
#lets take only required columns such as latitude,longitude and totalDocks

In [ ]:
loc_df[['id','latitude','longitude','totalDocks']]
loc_df.head(5)

In [ ]:

code_dict={} # dictionary with station id as key and latitude,longitude as values
doc_dict={} #dictionary with station id as key and number of docking ports as column

for a in zip(loc_df.id,loc_df.latitude,loc_df.longitude,loc_df.totalDocks):
    code_dict[a[0]]=((a[1],a[2]))
    doc_dict[a[0]]=((a[3]))
    
code_dict

In [ ]:
total_trips['Total_Docks']=total_trips['from_station_id'].map(doc_dict)

In [ ]:
total_trips['From_stn_loc']=total_trips['from_station_id'].map(code_dict)
total_trips['To_stn_loc']=total_trips['to_station_id'].map(code_dict)

In [ ]:
null_columns=total_trips.columns[total_trips.isnull().any()]
total_trips[null_columns].isnull().sum()

In [ ]:
nans = lambda df: df[df.isnull().any(axis=1)]
nans(total_trips)[1:10]

In [ ]:
# can observe that there are null values in above dataset because certain stations are not in operation as per 'station.json ''
# which is recent recorded data

In [160]:
total_df_locs=total_trips.dropna()
total_df_locs.head()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
0,2355134,2014-06-30 23:57:00,2014-07-01 00:07:00,2006,604,131,Lincoln Ave & Belmont Ave,303,Broadway & Cornelia Ave,Subscriber,Male,1988.0
1,2355133,2014-06-30 23:56:00,2014-07-01 00:00:00,2217,263,282,Halsted St & Maxwell St,22,May St & Taylor St,Subscriber,Male,1992.0
2,2355130,2014-06-30 23:33:00,2014-06-30 23:35:00,2798,126,327,Sheffield Ave & Webster Ave,225,Halsted St & Dickens Ave,Subscriber,Male,1993.0
3,2355129,2014-06-30 23:26:00,2014-07-01 00:24:00,173,3481,134,Peoria St & Jackson Blvd,194,State St & Wacker Dr,Subscriber,Female,1988.0
4,2355128,2014-06-30 23:16:00,2014-06-30 23:26:00,173,638,320,Loomis St & Lexington St,134,Peoria St & Jackson Blvd,Subscriber,Female,1988.0

In [161]:
total_df_locs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9645634 entries, 0 to 9645633
Data columns (total 12 columns):
trip_id              int64
starttime            datetime64[ns]
stoptime             datetime64[ns]
bikeid               int64
tripduration         int64
from_station_id      int64
from_station_name    object
to_station_id        int64
to_station_name      object
usertype             object
gender               object
birthyear            float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(4)
memory usage: 956.7+ MB